Revit 2027 API
RenderingSettings.GetRenderingRegionOutline Method
 Returns the outline of the rendering region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline GetRenderingRegionOutline()
Public Function GetRenderingRegionOutline As Outline
public:
Outline^ GetRenderingRegionOutline()
member GetRenderingRegionOutline : unit -> Outline
Return Value
Outline
 The outline of the rendering region.
Exceptions
Exception | Condition
InvalidOperationException |  The RenderingSettings are not currently using region rendering.
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace